{
  "gearType": [
    {
      "gear": "Senior Ruby on Rails Engineer Quimbee • Charlotte, NC",
      "gearList": [{
          "item": "Led the successful implementation of NFT minting and staking features across Ethereum, Solana, and Polygon networks, leveraging Solidity and Rust; achieved a 300% increase in token adoption and drove exponential growth in user engagement."
        },
        {
          "item": "Developed and maintained web applications using Ruby on Rails,JavaScript, HTML5, CSS3, MySQL/PostgreSQL."
        },
        {
          "item": "Collaborated with product managers to understand business requirements and translate them into technical specifications for the application."
        },
        {
          "item": " Communicated directly with clients regarding project status and issues as they arise in a timely manner."
        },
        {
          "item": "Worked closely with designers to implement designs within the framework of the application’s architecture."
        },
        {
          "item": "Participated in code reviews when applicable and worked independently or collaboratively depending on task at hand.",
          "type": ["Aug 2022", "Aug 2023"]
       
        }
      ]
    },
    {
      "gear": "Engineer - React/Javascript, Python, Golang Amex • Sunrise, FL",
      "gearList": [{
          "item": " Developed and maintained Golang microservices for a large-scale, high-throughput trading platform with 100+developers in the team."
        },
        {
          "item": " Implemented RESTful APIs to connect React applications with backend services using Go channels and goroutines."
        },
        {
          "item": " Designed and implemented highly scalable solutions by leveraging concurrency primitives such as multi threading, mutexes, semaphores etc., along with best practices like TDD (Test Driven Development)."
        },
        {
          "item": " Participated in code reviews of other engineers’ work and ensured that all code adheres to company’s coding standards & guidelines."
        },
        {
          "item": "Worked closely with the designer to design and implement the various UI/UX components for some of the company's largest projects."
        },
        {
          "item": " Used tools such as Git, Jira, Slack for version control, bug tracking and communication respectively",
          "type": ["Feb 2021", "Apr 2022"]
        }
      ]
    },
    {
      "gear": "Golang Application Developer Career Soft Solutions • Eden Prairie, MN 55343",
      "gearList": [{
          "item": "Worked with a team of five developers to create an API for the company’s mobile app"
        },
        {
          "item": " Created unit tests and integration tests using Go, Python, PHP and JavaScript for all new code submissions."
        },
        {
          "item": " Improved existing RESTful APIs by adding more functionality and error handling capabilities"
        },
        {
          "item": " Collaborated with other Golang developers on open source projects in GitHub repositories."
        },
        {
          "item": "Implemented security features such as OAuth 2 authentication and encryption mechanisms (e.g., TLS).",
          "type": ["Jun 2020 ", "Jan 2021"]
        }
      ]
    },
    {
      "gear": "Intern Web Developer (Rewind | Ottawa, Canada)",
      "gearList": [{
          "item": "Utilized HTML5, CSS3, SASS, JavaScript, JQuery, AJAX, Node.js, and Bootstrap extensively for intuitive and flexible web portal designs."
        },
        {
          "item": "Produced visually captivating websites using JavaScript libraries including Angular, React, and Vue, integrating advanced React.js components, Forms, Events, Keys, Router, Redux, Animations, and Flux concepts, leading to enhanced user engagement and intensified conversion rates by 20%."
        },
        {
          "item": "Built a website, with a flexible layout and user-friendly so the number of active users improved by 27.3%."
        },
        {
          "item": "Participated in 3 continuing education training courses to learn modern practices and to learn new coding languages."
        },
        {
          "item": "Wrote code following industry standards and Figma design patterns from 3 projects."
        },
        {
          "item": "Designed a website for a local TV by applying the skill received from the development and full experience as a graphic designer, which resulted in the improvement of the website performance and web traffic by 31%."
        },
        {
          "item": "Suggested 20 improvements to product design and functionality as informed by user experience reporting.",
          "type": ["Dec 2015 ", "Oct 2019"]
        }
      ]
    }
  ]
}